app/controllers/languages_controller.rb

    def create
      language = Language.new
      language.name = params[:language][:name]
      language.save
---
INSERT INTO "languages" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2019-04-04 00:29:03.063089"], ["updated_at", "2019-04-04 00:29:03.063089"]]

    def index
      @languages = Language.all
---
SELECT "languages".* FROM "languages"

    def edit
      @language = Language.find(params[:id])
---
SELECT  "languages".* FROM "languages" WHERE "languages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
      language = Language.find(params[:id])
      language.name = params[:language][:name]
      language.save
---
SELECT  "languages".* FROM "languages" WHERE "languages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "languages" SET "name" = ?, "updated_at" = ? WHERE "languages"."id" = ?  [["name", "test111111"], ["updated_at", "2019-04-04 00:50:15.996699"], ["id", 1]]

    def remove
      language = Language.find(params[:language_id])
      language.destroy
---
SELECT  "languages".* FROM "languages" WHERE "languages"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "languages" WHERE "languages"."id" = ?  [["id", 5]]